Repository: Lilium27/Creating-Intelligent-Content-with-Lightweight-DITA-Translation-Project
Catalog: omegat/project_save.tmx
Source language: en
Languages: zh_cn

source: Elements, however, do have recognizable limits and often have corresponding markup tags” (1998, p.
zh_cn: 然而，元素确实具有可识别界限，并且通常具有相应的标记。 (1998, p.

source: Elovirta, who is the lead developer of the DITA Open Toolkit, generously contributed many open source hours to incorporating changes and suggestions that Priestley and I requested for our demos and conference presentations.
zh_cn: 艾洛维塔是 DITA Open Toolkit 的主要开发人员，他慷慨地贡献了大量的时间将我和普里斯特利在样例和会议演示中所要求的改进以及我们的建议都开发出来，集成在现有工具中并且开源。

source: Empowered learner
zh_cn: 有能力的学习者

source: Entry points
zh_cn: 入口

source: Error messages.
zh_cn: 错误信息.

source: Essays from whole cloth is more the thing.
zh_cn: 具有创作完整性文章的能力更加重要。

source: Essential move of technical communication
zh_cn: 技术传播基本文步

source: Evaluating Content Developers as Computational Thinkers
zh_cn: 从计算机思维的角度评估内容开发人员

source: Evaluating the coverage of topics related to CM in academic work, Andersen lamented that technical communication “scholarship on CM to date has almost exclusively taken an academic perspective; when articulating and theorizing trends, methods, and technologies, we tend to situate our discussions within the existing scholarship rather than the larger CM discourse that is actively shaping CM practice” (Andersen, 2014, p.
zh_cn: 在评估学术工作中与CM相关的话题的覆盖率时，安德森感叹道：“迄今为止，在技术传播领域，关于CM的研究几乎都是从学术角度出发的，我们倾向于在现有的学术领域内讨论和推断趋势、方法、科技，而非在更大的CM话语范围内讨论，而后者对CM实践有积极作用” (Andersen, 2014, p.

source: Even after retirement from her faculty position at North Carolina State University, Miller continues her explorations on the human need for genres in culture, literature, and the sciences “to help us make sense of this blooming, buzzing confusion” of new forms of communication and interaction (Miller, 2015, p.
zh_cn: 即使是从北卡罗莱纳州立大学的教职岗位退休后，米勒仍在继续探索人类对文化、文学和科学上各种体裁的需求，以“帮助我们理解这种蓬勃发展、喧嚣纷乱、令人困惑”新的传播和交互形式。(Miller, 2015, p.

source: Even before LwDITA existed, when my courses were based on full DITA XML, authoring was the “easy” part.
zh_cn: 即使在LwDITA出现之前，当我的课程基于完整的DITA XML时，创作也是“容易”的部分。

source: Even before we started using the term “authoring formats” (which came from Eliot Kimber 一 the ultimate expert on XML for technical communication and a vital member of the DITA Technical Committee), in the Lightweight DITA subcommittee the analogy of flavors drove the development of mappings to represent DITA components in diverse markup languages.
zh_cn: 在我们开始使用术语“创作格式”前（这一概念由艾略特·金伯 （Eliot Kimber）提出 —— 他是技术传播领域的XML专家同时还是DITA技术委员会的重要成员），在轻量级DITA的小组委员会上，冰淇淋口味的比喻推动了映射的发展，以多种标记语言表示DITA组件。

source: Even in its base edition, DITA 1.3 has 4 document types and 189 element types.
zh_cn: 即使 DITA 1.3标准基础版本也包括4种文档类型和189种元素类型。

source: Even in its version 1.0, the standard had a total of 193 element types.
zh_cn: 即使是在1.0版本中，标准中就已经有了193 中元素类型。

source: Even today, they still have the plastic on them in libraries.
zh_cn: 直到今天，图书馆里的手册仍保留着塑封，

source: Even when concept, task, reference, and the other document types from the DITA 1.3 specification are available for more rigorous structure, the generic topic can be powerful for users trained to think about structured content before writing.
zh_cn: 即使 DITA 标准 1.3版本中的概念（concept）、任务（task）、引用（referenve）和其他文档类型可以用于构造更严密的结构，对于训练有素、能够在编写之前思考如何结构化内容的用户来说，通用主题仍然很强大。

source: Eventually, it called for a combination of Information Mapping and DITA for structuring and publishing content.
zh_cn: 最终，白皮书呼吁将信息映射和 DITA 结合起来，以构建和发布内容。

source: Except they did not.
zh_cn: 除非他们以前并不这样做。

source: Experienced users will refer directly to the reference material in other chapters.
zh_cn: 老用户会直接跳转到其他章节的参考资料。

source: Explain what the user must do to eliminate the error condition.
zh_cn: 解释用户应当进行何种操作才能消除错误。

source: Explaining What the Product or Procedure Does
zh_cn: 解释产品或流程的功能

source: Exploring Intelligent Content-development Lifecycles
zh_cn: 探索智能内容开发的生命周期

source: FIGURE 1.2 Sarah O'Keefe's sample recipe for marinara sauce in XML.
zh_cn: 图1.2 莎拉·奥基夫提供的 XML 格式的意式番茄罗勒酱菜谱示例。

source: FIGURE 1.4 Marinara sauce DITA task transformed to a PDF deliverable.
zh_cn: 图1.4 意式番茄罗勒酱 DITA 任务（task）话题转换生成的 PDF 交付文件。

source: FIGURE 1.5 Marinara sauce DITA task transformed to an HTML5 deliverable.
zh_cn: 图1.5 意式番茄罗勒酱 DITA 任务（task）话题转换生成的 HTML5 交付文件。

source: FIGURE 1.6 DITA map for Chef Pedro's recipe critique website.
zh_cn: 图1.6 佩德罗菜谱评价网站的 DITA 地图。

source: FIGURE 1.7 Navigation menu for a web transformation of Chef Pedro's recipe critique project.
zh_cn: 图1.7 佩德罗菜谱评价项目网页输出物的导航菜单。

source: FIGURE 2.2 DITA topic including biographical information about Chef Pedro. The topic's elements include simple structures like a title, a short description, and a body containing paragraphs.
zh_cn: 图 2.2 包含佩德罗传记信息的DITA主题。主题的元素包括简单结构，如标题、简短描述和包含段落的正文。

source: FIGURE 3.1 Prototype of an early LwDITA topic created by Michael Priestley in the summer of 2012.
zh_cn: 图3.1 迈克尔·普里斯特利于在2012年夏天创建的早期 LwDITA 话题的原型。

source: FIGURE 5.11 Quick web deliverable created by the HDITA version of the Sensei
zh_cn: 图5.11由 HDITA 格式的 Sensei Sushi 手册地图快速生成的

source: FIGURE 5.12 Command for the DITA-OT to generate a PDF deliverable from the HDITA version of the Sensei Sushi brochure.
zh_cn: 图5.12 利用 DITA-OT 将 Sensei Sushi 手册的 HDITA 地图生成 PDF 交付物所需输入的命令。

source: FIGURE 5.4 DITA topic including biographical information about Chef Pedro. The topic's elements include simple structures like a title, a short description, and a body containing paragraphs.
zh_cn: 图5.4 DITA 话题的内容包含对厨师佩德罗的生平介绍。用到的话题元素有标题元素、简短描述元素、段落元素、主体元素等简单结构，其中段落元素包含在主题元素内部。

source: FIGURE 5.5 General structure for a command that builds DITA (and LwDITA) deliverables with the DITA-OT.
zh_cn: 图5.5 用 DITA-OT 构建 DITA（和 LwDITA）交付物的通用命令结构。

source: FIGURE 5.6 Command for the DITA-OT to generate a web deliverable from the marinara sauce critique DITA map.
zh_cn: 图5.6 利用 DITA-OT 将意式番茄罗勒酱评论的 DITA 地图生成网页交付物所需输入的命令。

source: FIGURE 5.7 Navigation menu for a web transformation of Chef Pedro's recipe critique project.
zh_cn: 图5.7 厨师佩德罗菜谱评价项目转换生成的网页版导航菜单。

source: FIGURE 6.10 Sample MDITA extended profile topic with a title component.
zh_cn: 图6.10 包含标题组件和扩展配置的 MDITA 话题示例，

source: FIGURE 6.14 XDITA topic with a body component.
zh_cn: 图6.14 包含主体组件的 XDITA 话题。

source: FIGURE 6.15 HDITA topic with paragraph components.
zh_cn: 图6.15 包含段落组件的 HDITA 话题。

source: FIGURE 6.2 Validation error reported by Oxygen XML Editor.
zh_cn: 图6.2 Oxygen XML Editor 的错误验证提示。

source: FIGURE 6.21
zh_cn: 图6.21

source: FIGURE 6.22 Unordered list environment in XDITA.
zh_cn: 图6.22 XDITA 中的无序列表组件。

source: FIGURE 6.3 Minimal HDITA topic.
zh_cn: 图6.3 最简化的 HDITA 话题。

source: FIGURE 6.4 Minimal MDITA topic.
zh_cn: 图6.4最简化的MDITA话题，

source: FIGURE 6.5 Sample MDITA extended profile topic with an assigned @id in a YAML header.
zh_cn: 图6.5 包含扩展配置的 MDITA 话题示例，该示例在 YAML 头中指定了 @id 。

source: FIGURE 6.7 Author mode in Oxygen XML Editor.
zh_cn: 图6.7 Oxygen XML Editor 的作者模式。

source: FIGURE 6.9 Sample MDITA core profile topic with a title component.
zh_cn: 图6.9 包含标题组件的 MDITA 话题示例，其中标题使用一级标题表示，

source: FIGURE 1.1 Screen capture from the video “The Future of Technical Communication,” by Adobe Technical Communication Suite.
zh_cn: 图 1.1 AdobeTCS 制作的视频“技术传播的未来”的截图。

source: FIGURE 1.3 Marinara sauce recipe as a DITA task.
zh_cn: 图1.3改造成 DITA 任务（task）话题的意式番茄罗勒酱菜谱。<100/100/95% >

source: FIGURE 2.1 Expanded version of the marinara sauce recipe as a DITA task. Elements in bold type emphasize some of the moves of interacting with users that the DITA creators had in mind when developing the document types.
zh_cn: 表格 2.1 以DITA任务形式展现扩展版的意式番茄罗勒酱菜谱。以粗体显示的元素强调了DITA创建者在开发文档类型时想到的与用户交互的一些步骤。

source: FIGURE 3.2 Early “MarkDITA” topic prototype that I shared with Michael Priestley and Jenifer Schlotfeldt in May of 2014.
zh_cn: 图3.2 2014年5月我与迈克尔·普里斯特利和珍妮弗·斯洛特菲尔德分享的早期“MarkDITA”话题原型。

source: FIGURE 4.1 Sample DITA topic showing the difference among elements with mixed content and those with just character data or just child elements.
zh_cn: 图4.1 DITA主题示例显示含混合内容的元素与只包含字符数据或子元素的元素之间的差异。

source: FIGURE 4.2 Sample HTML5 file with a combination of list items including character data and child elements.
zh_cn: 图4.2 HTML5示例文件是列表项的组合，其中包括字符数据和子元素。

source: FIGURE 5.1 DITA map for Chef Pedro's recipe critique website.
zh_cn: 图 5.1 佩德罗菜谱评价网站的 DITA 地图。

source: FIGURE 5.10 HDITA version of the map to create the Sensei Sushi promotional brochure.
zh_cn: 图5.10 用于创建 Sensei Sushi 宣传手册的 HDITA 格式地图。

source: FIGURE 5.13 MDITA version of the map to create the Sensei Sushi promotional brochure.
zh_cn: 图5.13 用于创建 Sensei Sushi 宣传手册的 HDITA 格式地图。

source: FIGURE 5.14 Command for the DITA-OT to generate a PDF deliverable from the MDITA version of the Sensei Sushi brochure.
zh_cn: 图5.14 利用 DITA-OT 将Sensei Sushi 手册的 MDITA 地图生成 PDF 交付物所需输入的命令。

source: FIGURE 5.2 Marinara sauce recipe as a DITA task.
zh_cn: 图5.2改造成 DITA 任务（task）话题的意式番茄罗勒酱菜谱。

source: FIGURE 5.3 Marinara sauce recipe critique as a DITA concept.
zh_cn: 图5.3改造成 DITA 概念（concept）话题的意式番茄罗勒酱菜谱评价

source: FIGURE 5.8 XDITA version of the map to create the Sensei Sushi promotional brochure.
zh_cn: 图5.8 用于创建 Sensei Sushi 宣传手册的 XDITA 格式地图。

source: FIGURE 5.9 Command for the DITA-OT to generate a PDF deliverable from the XDITA version of the Sensei Sushi brochure.
zh_cn: 图5.9 利用 DITA-OT 将Sensei Sushi 手册的 XDITA 地图生成 PDF 交付物所需输入的命令。

source: FIGURE 6.1 Minimal XDITA topic.
zh_cn: 图6.1 最简化的 XDITA 话题。

source: FIGURE 6.11 XDITA topic with a short description component.
zh_cn: 图6.11 包含简短描述组件的 XDITA 话题。

source: FIGURE 6.12 HDITA topic with a short description component.
zh_cn: 图 6.12 包含简短描述组件的 HDITA 话题。

source: FIGURE 6.13 MDITA topic with a short description component.
zh_cn: 图6.13 包含简短描述组件的 MDITA 话题，

source: FIGURE 6.16 MDITA topic with paragraph components.
zh_cn: 图6.16包含段落组件的 MDITA 话题。

source: FIGURE 6.17 Definition list environment in XDITA.
zh_cn: 图6.17 XDITA 中的定义列表组件。

source: FIGURE 6.18 Definition list environment in HDITA.
zh_cn: 图6.18 HDITA 中的定义列表组件。

source: FIGURE 6.19 Definition list environment in an MDITA extended profile topic.
zh_cn: 图6.19 包含扩展配置的 MDITA 话题中的定义列表组件。

source: FIGURE 6.20 Ordered list environment in XDITA.
zh_cn: 图6.20 XDITA 中的有序列表组件。

source: Figure 6.5 shows the franchise.intro.md topic with an assigned @id of sensei- intro that would override the @id generated with the file's name.
zh_cn: 图6.5展示了 franchise.intro.md 话题，其指定 @id 为 sensei- intro ，它将覆盖用文件名称自动生成的 @id 。

source: Figure 1.6 shows a very basic DITA map for Chef Pedro's recipe critique website.
zh_cn: 图1.6 展示了佩德罗菜谱评价网站的一个非常基本的 DITA 地图。

source: Figure 5.10 shows the HDITA version of the map for creating the brochure.
zh_cn: 图5.10展示了用于创建宣传手册的 HDITA 格式地图。

source: Figure 5.14 shows the DITA-OT command for processing an MDITA map and producing a PDF deliverable, which looks very similar to the one used for the transformations in XDITA and HDITA.
zh_cn: 图5.10展示了利用 DITA-OT 转换 MDITA 格式的地图，并生成 PDF 交付文件所需输入的命令，它与转换 XDITA 和 HDITA 格式的地图所需的命令非常相似。。

source: Figure 5.8 shows the XDITA version of the map.
zh_cn: 图5.8展示了 XDITA 格式的地图。

source: Figure 5.9 shows the DITA-OT command for processing an XDITA map and producing a PDF deliverable, which looks very similar to the one used for the DITA map transformation.
zh_cn: 图5.9展示了利用 DITA-OT 转换 XDITA 格式的地图，并生成 PDF 交付文件所需输入的命令，它与转换 DITA 格式的地图所需的命令非常相似。

source: Figure 6.13 presents the same topic in MDITA extended profile, which includes the YAML header with an assigned @id, an atx heading for the title, and the short description implied in the first paragraph.
zh_cn: 图6.13展示含有扩展配置的MDITA话题示例，包含指定 @id 的YAML头、 atx 语法格式的标题，以及隐藏在第一段中的简短描述。

source: Figure 6.23 shows the same topic in HDITA syntax.
zh_cn: 图6.23展示了用 HDITA 语法编写的同一话题。

source: Figure: a container for a variety of objects, including artwork, images, code samples, equations, and tables.
zh_cn: 图（figure）：展示各种对象，包括插图、图像、代码示例、方程式和表格。

source: First, I define XML for the specific context of Creating Intelligent Content with Lightweight DITA.
zh_cn: 首先，我会基于本书具体的语境定义 XML。

source: Fix the content - Authors need to rethink how to write content to thoroughly separate form from content.
zh_cn: 固定内容- 作者需要重新考虑如何编写内容实现形式与内容的彻底分离。

source: Fix the design - Architects need to rethink how to classify and design information, to reduce the cost of upfront analysis and ongoing maintenance for content-specific markup.
zh_cn: 固定设计 - 架构师需要重新考虑如何对信息进行分类和设计，以减少预先分析和对特定内容标记进行持续维护的成本。

source: Fix the process - Programmers need to rethink how to create transforms and processes, to allow content-specific information to be exchanged, and to make it easier to create and maintain specialized processes.
zh_cn: 固定流程 - 程序员需要重新考虑如何创建转换和流程，如何允许特定内容的信息进行交换，以及如何简化创建和维护专门的过程。

source: Focusing on a different genre of technical writing, Carolyn Miller and Jack Selzer analyzed the structure and argumentation elements of technical reports by detailing their rhetorical conventions, or topical basis of discourse.
zh_cn: 卡洛琳·米勒（Carolyn Miller）和杰克·瑟尔泽（Jack Selzer）以技术写作的不同体裁作为研究重点，通过详细分析其修辞惯例或话语主题基础，分析了技术报告的结构和论证要素。

source: Following reports from its working groups, which included a collection of personas and usage scenarios across diverse sectors and industries, the Lightweight DITA subcommittee at OASIS determined that a generic topic could represent most content structures needed across potential implementations.
zh_cn: OASIS 轻量级 DITA 小组委员会根据各个工作组的报告（包括来自不同部门和行业的一系列用户画像和使用场景调查），确定了只要一个通用话题就可以代表潜在实践中需要的大多数内容结构。

source: Following that model, computing engineers can master the complexity of communicating high-level human needs and processes (e.g., check email messages, create a spreadsheet, watch a movie on Netflix) to the low- level electronic signals and components of a computer.
zh_cn: 遵循这个模型，计算机工程师可以掌控高级别的人类需求和流程（如检查电子邮件信息，创建电子表格，在Netflix上观看电影）与低级别的电子信号和计算机组件之间的复杂沟通。

source: Footnote: text that annotates content with notes that are inappropriate for inline inclusion.
zh_cn: 脚注（footnote）：不适合写在正文内容的注释内容，

source: For Chef Pedro's content needs, a very simple topic would look as the example in Figure 6.1.
zh_cn: 厨师佩德罗的内容需求可以编写成一个非常简单的话题，如图6.1所示。

source: For Chef Pedro, adopting a standard like DITA simplifies the process of structuring content and producing information deliverables for human users.
zh_cn: 对于厨师佩德罗来说，采用 DITA 这样的标准简化了用户创建结构化内容、生成可交付信息的过程。

source: For a team of authors with diverse technical backgrounds and communication skills, the different formats of LwDITA allow collaboration and content exchange in a centralized solution.
zh_cn: 对于具有不同技术背景和交流技能的作者团队来说，不同格式的 LwDITA 允许在集中化的解决方案中进行协作和内容交换。

source: For an audience of curious but hesitant academics, this book demystifies the process of authoring and processing intelligent content.
zh_cn: 对于好奇而又犹豫的学术界读者来说，这本书揭示了创作和处理智能内容的过程，

source: For an author, the main benefit from Hackos's list is in the “fully tested DTD or schema for XML-based authoring,” which I discuss in the next section.
zh_cn: 对于作者来说，哈克斯列出的优点中比较重要的一项是“DITA 是一种经过充分检验的用于 XML 创作的 DTD 或模式”，我将在下一节中讨论这一点。

source: For any reader, Creating Intelligent Content with Lightweight DITA places human authors at the center of intelligent content workflows, proposing that adopting LwDITA as a thought process and authoring schema will provide writers with some of the benefits associated with other information standards (DITA included) while emphasizing thinking and abstraction over automation and machine processing.
zh_cn: 对任何读者来说，本书将人类作者置于创作智能内容工作流的中心，认为采用 LwDITA 作为思维过程和创作模式将为作者提供一些其他信息标准（包括 DITA）也有的优势，与此同时强调思考能力和抽象能力，而不是自动化和机器处理能力。

source: For authors of technical content, these foundational topic types provide constraints and structures beyond a presentation-oriented template.
zh_cn: 对于技术内容的写作者来说，这些基本话题类型提供了面向展示的模板之外的约束和结构。

source: For both of these audience groups, the mandate of “go learn about intelligent content and then bring it back to your work” responds to the call for ways to better align education and research in technical communication with practice that Andersen (2014) categorizes as certainly not new but never so urgent.
zh_cn: 对这两类读者群体而言，“学习智能内容开发，然后把它运用到工作里去”的建议，响应了 对更好地将技术传播的教学和研究与实践结合起来的呼吁，安德森 (2014) 表示这种呼吁当然不是什么新鲜事，但是非常紧迫。

source: For example, Pedro can hire a technical writer to create recipe topics in XDITA (based on XML) while a marketing professional writes a description of the cookbook's features in HDITA (based on HTML5), and an engineer uses MDITA (based on Markdown) to create a reference for a specific command from the kitchen's laboratory.
zh_cn: 例如，佩德罗可以雇佣一个技术写作人员用 XDITA（基于 XML）创建菜谱话题，雇佣一个市场营销专员用 HDITA（基于 HTML5）编写菜谱特性简介，再雇佣一个工程师使用 MDITA（基于 Markdown）为厨房实验室的特殊命令创建一个引用话题。

source: For example, the website “DITA Writer” maintains a list of companies using DITA based on reports from social media channels.
zh_cn: 例如，网站 DITA Writer 根据社交媒体统计的报告，维护了一份使用 DITA 的公司名单。

source: For example, Chef Pedro is going to need to provide ingredients for his recipes, so he could create an ingredients specialization to include this specific element (i.e., <ingredients> as a specialization of <prereq> for pre-requisites).
zh_cn: 例如， 佩德罗需要为菜谱编写食材，所以他可以创建特有的食材标签来包含每个特定食材（如 <ingredients> 是表示前期准备的标签 <prereq> 下的特有标签）。

source: For example, Linda Flower explored transferable tasks in professional writing through the use of schemas and writing plans, acknowledging that “many discourse conventions are, in fact, formalizations of rhetorical moves” (Flower, 1989, p.
zh_cn: 例如，琳达·弗劳尔通过图式和写作计划探索了专业写作中的可转换的任务，她承认“实际上，很多语篇惯例不过是修辞文步的正式形式。” (Flower, 1989, p.

source: For example, a concept could be an introduction to the sauces section in Chef Pedro's recipe book, while tasks can provide recipes for specific salsas and condiments (he can write a step about dicing tomatoes once and reuse in all the recipes that need it!), and a reference topic can list common techniques and tools for preparing ingredients.
zh_cn: 例如，“概念”（concept）可以是对厨师佩德罗菜谱中酱汁部分的介绍，“任务”（task）可以为特定的辛香番茄酱和调味料提供菜谱（佩德罗可以写一个将番茄切成小块的操作步骤，然后在所有需要用到这一步骤食谱中重复使用！），“参考”（reference）可以列出准备食材的常用技术和工具。

source: For example, in XDITA and HDITA only a handful of elements allow character data.
zh_cn: 例如，在XDITA和HDITA中，只有少数元素允许字符数据。

source: For example, task orientation was originally defined as: “A focus on helping users complete the tasks associated with a product in relation to their jobs,” (Hargis, 1998, p.
zh_cn: 例如，面向任务最初被定义为:“专注于帮助用户完成与其工作相关的产品的任务，” (Hargis, 1998, p.

source: For interested practitioners, this book presents the logical and computational essence of changes and improvements on a major documentation standard.
zh_cn: 对于感兴趣的从业者来说，这本书展现了对一个重要文档标准进行改动和提升的逻辑和计算本质。

source: For introductory experiments like the marinara recipe from Chapter 1, Notepad for Windows or TextEdit in macOS (be sure to select Format/Make Plain Text before saving your files) can work.
zh_cn: 对于介绍性试验，比如第一章中的意式番茄罗勒酱的食谱，Windows中的记事本或macOS中的TextEdit(确保在保存文件之前选择格式/纯文本格式 )都可以。

source: For now, just focus on the fact that XML uses tags to identify the types of rhetorical “moves” that the content on the page represents.
zh_cn: 现在只需要知道XML使用标签来识别页面内容所表示的修辞关系。

source: For someone like Chef Pedro (and even for many of my technical writing students), creating the tags to structure content in XML can be an easy-to- learn task.
zh_cn: 对于像佩德罗这样的人（甚至对于我的许多正在学习使用技术写作的学生）来说，利用 XML 的标记来创建结构化内容非常容易。

source: For students and practitioners of content development or technical communication, demonstrating knowledge of computing in the context of their profession is, therefore, a goal when talking about computational thinking or computational literacy.
zh_cn: 因此，对于学习内容开发或技术传播的学生和从业者来说，谈及计算机思维或计算机素养时，他们的目标是在自己的专业背景下展示计算机知识。

source: For technical communicators creating intelligent content, the negative side of schemas (probably presented as XML files) is in the “perception that XML forces writers into creating cookie-cutter topics rather than useful technical information” (O'Keefe, 2010, p.
zh_cn: 对于创建智能内容的技术传播工程师来说，模式(可能以XML文件的形式呈现)的负面影响是“XML格式迫使作者创建千篇一律的主题，而非有用的技术信息”。(O'Keefe, 2010, p.

source: For this week's entry, he will critique the marinara sauce recipe from Figure 1.3.
zh_cn: 本周，他将如图1.3所示点评意式番茄罗勒酱的菜谱。

source: For version 1.3 of the DITA spec, the Technical Committee actually separated the standard's 621 available elements in three editions: base (with 189 elements), technical content (including the elements from the base edition and 251 additional elements), and all inclusive (including the elements from base, technical content, and 181 additional elements).
zh_cn: 在1.3版本< t0 / > < t1 / >的DITA规范中，技术委员会将标准中可用的621中可用元素划分成了三版：基础版（含189 个元素），技术内容版（含基础版的元素及251 个额外元素），全能版（包括基础版和技术内容版的元素及181 个额外元素）

source: For years, some technical communicators in academia and industry have seen DITA as a tool, and some perceive it as an alternative to software applications like Microsoft Word or Adobe FrameMaker.
zh_cn: 多年来，学术界和业界的一些技术传播工程师已将DITA视为一种工具，有些人还将其视为Microsoft Word或Adobe FrameMaker等软件应用程序的替代品。

source: Format-free content “does not include presentation information, such as instructions about fonts, column widths, or text placement.” The separation of format and content is essential for multichannel publishing, and the layer of abstraction provided by a desktop publishing application in this regard can be a dangerous one.
zh_cn: 无格式内容“不包括展示信息，如描述字体、列宽或文本位置的说明” 。格式和内容分离对多渠道发布是至关重要的，而桌面发布应用程序在这方面提供的抽象功能可能并无益处。

source: From a cautionary or preventive perspective, planning ahead can minimize the future impact of dealing with legacy content siloed in one platform.
zh_cn: 从警示或预防的角度来看，提前计划可以将以后处理某一平台遗留内容的可能性降到最小。

source: From an educational perspective, some authors mentioned in the next section claim that making computation, and its potential benefits, available to thinkers of all disciplines is a responsibility in academia.
zh_cn: 从教育的角度来看，在下一节中将提到的一些作者认为，让所有学科的学生都能掌握计算思维，享受其带来的益处是学术界的责任。

source: From the perspective of computing education, Mark Guzdial provides a supporting statement for teaching computing principles outside of computer science courses:
zh_cn: 从计算机教学的角度来看，马克·古齐亚尔（Mark Guzdial）支持在计算机科学课程之外教授计算机原理：

source: From the practitioner side of technical communication, O'Keefe points out that XML “defines a standard for storing structured content in text files” (2009, p.
zh_cn: 从技术传播的从业者的角度来看，奥基夫指出 XML “定义了在文本文件中存储结构化内容的标准”（2009年，第

source: Furthermore, LwDITA will maintain its compatibility with future releases of DITA XML, which preserves the simplified proposed standard as both an independent way to structure and publish content and a potential on-ramp for individuals and teams who start with LwDITA and then decide to explore the enhanced capabilities of DITA.
zh_cn: 此外，LwDITA 将保持与未来版本的 DITA XML 的兼容性，LwDITA 将是一种独立的结构化和发布内容的方法，而对了解了 LwDITA，然后决定探索 DITA 增强功能的个人和团队来说，也是一个潜在的学习入口。

source: Furthermore, blogs and social media postings from content professionals create and maintain an active online community of discussion and recommendations.
zh_cn: 此外，内容专家的博文和社交媒体帖子创建并维持了一个活跃的在线讨论推荐社区。

source: Furthermore, his example is still relevant when thinking about LwDITA and computational thinking: an author needs to separate the layers of abstraction when creating a task topic for a specific audience and context.
zh_cn: 此外，在讨论到 LwDITA 和计算机思维时，约翰逊·艾劳拉的示例仍然是有用的：创作者在为特定受众和上下文创建任务（topic）主题时，需要分离不同的抽象层。

source: Furthermore, there is no markup language called Lightweight DITA, as the markup languages included in this framework are called XDITA, HDITA, and MDITA.
zh_cn: 此外，没有哪一个标记语言叫轻量级 DITA，而 LwDITA 框架中包含的标记语言被称作 XDITA、HDITA 和 MDITA。

source: Furthermore, this sample topic stub is not yet valid XDITA.
zh_cn: 而且，示例中的话题片段还不是有效的 XDITA 格式。

source: Furthermore, those layers of abstraction from the 2015 publication are XML-centric, because we used them to teach DITA XML.
zh_cn: 此外，2015年发布的抽象层级是以 XML 为中心的，因为我们使用它们来教授 DITA XML。
